Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/employment_rights_and_duties/employment_law_update.html.txt.tmx
Source language: en
Languages: ga

source: • Complaint or breach of rights
ga: • Gearáin nó sárú cearta

source: If you have been out of the workforce for some time, you will need to update yourself on changes that have occurred in the field of employment protection
ga: Má tá tú imithe ón lucht oibre le roinnt ama, beidh ort tú féin a chur ar an eolas maidir leis na hathruithe atá tagtha ar cheisteanna a bhaineann le cosaint fhostaíochta

source: There have been some substantial changes and acquainting yourself with these developments will help you to maximise your rights
ga: Tá go leor athruithe móra tagtha i bhfeidhm le deich mbliana anuas agus beidh sé níos éasca duit an chuid is fearr a bhaint as do chearta má chuireann tú eolas ar na forbairtí seo

source: Employment protection developments 1993-2016
ga: Forbairtí um chosaint fhostaíochta 1993-2016

source: The following is a summary of the legislation that has been introduced in this period concerning employment protection:
ga: Is é seo a leanas achoimre ar an reachtaíocht a bhaineann le cosaint fhostaíochta a tháinig i bhfeidhm sa tréimhse seo

source: • The Paternity Leave and Benefit Act 2016 provides for statutory paternity leave of 2 weeks to be taken in the first 6 months following birth or adoption of a child
ga: • An tAcht um Shaoire agus Sochar Atharthachta 2016: Soláthraíonn an tAcht 2 seachtain saoire atharthachta reachtúil a dtógtar taobh istigh den chéad 6 mhí tar éis breithe nó uchtaithe linbh

source: • Equality (Miscellaneous Provisions) Act 2015 provides for certain changes in the exclusions of discrimination and prohibits discrimination against tenants getting a social welfare payment or a Housing Assistance Payment (HAP)
ga: • An tAcht Comhionannais (Forálacha Ilghnéitheacha) 2015: Soláthraíonn an tAcht athrú áirithe san eisiamh idirdhealaithe. Faoin Acht tá idirdhealú i gcoinne tionóntaí a fhaigheann íocaíocht leasa shóisialaigh nó Íocaíocht Cúnaimh Tithíochta toirmiscthe

source: • Industrial Relations (Amendment) Act 2015 provides for a system of registered employment agreements and sectoral employment orders
ga: • An tAcht Caidrimh Thionscail (Leasú) 2015: Soláthraíonn an tAcht córas comhaontuithe fostaíochta cláraithe agus orduithe fostaíochta earnála

source: • Workplace Relations Act 2015 reorganises and reforms employment rights structures by establishing the Workplace Relations Commission that has replaced the Labour Relations Commission, Rights Commissioner Service, Equality Tribunal, and National Employment Rights Authority
ga: • An tAcht um Chaidreamh san Áit Oibre: Atheagraíonn agus athchóiríonn an tAcht na struchtúir um chearta fostaíochta reatha tríd bunú an Choimisiúin um Chaidreamh san Áit Oibre. Cuirtear an Coimisiún in ionad an Choimisiúin um Chaidreamh Oibreachais, na seirbhíse Choimisinéir um Chearta, an Bhinse Comhionannais agus Údaráis Náisiúnta um Chearta Fostaíochta

source: • Employment Permits (Amendment) Act 2014 amends and extends the Employment Permits Acts 2003 and 2006 through the provision of 9 different types of employment permit and changes to the criteria for issuing employment permits
ga: • An tAcht um Cheadanna Fostaíochta (Leasú) 2014: Leasaíonn agus síníonn an tAcht na hAchtanna um Cheadanna Fostaíochta 2003 agus 2006 trí sholáthar 9 gcineál dhifriúil ceadanna fostaíochta agus tríd athruithe ar na critéir le haghaidh eisiúint ceadanna fostaíochta

source: • Protected Disclosures Act 2014: This Act protects employees who make disclosures about wrongdoing that comes to their attention in the workplace from penalisation
ga: • An tAcht um Nochtadh Cosanta 2014: Cosnaíonn an tAcht seo fostaithe a dhéanann nochta faoi éagóir san ionad oibre ó ghearradh pionós orthu

source: • The Industrial Relations (Amendment) Act 2012: This Act reforms the wagesetting mechanisms for making Employment Regulation Orders and Registered Employment Agreements
ga: • An tAcht Caidrimh Thionscail (Leasú) 2012: Athchóiríonn an tAcht na meicníochtaí cinneadh pá le haghaidh Orduithe Rialaithe Fostaíochta agus Comhaontuithe Fostaíochta Cláraithe

source: • Protection of Employment (Temporary Agency Work) Act 2012: This Act provides that since 16 May 2012 all temporary agency workers must have equal treatment as if they had been directly recruited by the hirer in respect of the duration of working time, rest periods, night work, annual leave and public holidays and pay
ga: • An tAcht um Chosaint Fostaithe (Obair Ghníomhaireachta Shealadach) 2012: Soláthraíonn an tAcht seo nach mór caitheamh le hoibrithe gníomhaireacht mar fostaítear iad ag an bhfruilitheoir maidir le fad am oibre, sosanna, obair oíche, saoire bhliantúil agus saoirí poiblí agus pá ó 16 Bealtaine 2012

source: The right to equal pay is backdated to 5 December 2011
ga: Tá an ceart chun pá comhionann siardátaithe go dtí 5 Nollaig 2011

source: • Protection of Employment (Exceptional Collective Redundancies and Related Matters) Act 2007: This legislation establishes a redundancy panel to consider certain proposed collective redundancies
ga: • An tAcht um Chaomhnú Fostaíochta (Comhiomarcaíochtaí Eisceachtúla agus Nithe Gaolmhara) 2007: Bunaíonn an reachtaíocht seo Panéal Iomarcaíochta chun comhiomarcaíochtaí áirithe a plé

source: The Act also removes the upper age limit for entitlement to redundancy payments
ga: Tógann an tAcht an uasteorainn aoise chun teidlíocht ar íocaíoct iomarcaíochta a fháil

source: • Employment Permits Act 2006: This Act updates the Employment Permits Act 2003, introducing the Green Card permit and revising the legislation on work permits and spousal permits
ga: • An tAcht um Cheadanna Fostaíochta 2006 - Tugann an tAcht seo suas chun dáta an tAcht um Cheadanna Fostaíochta 2003. Cuireann sé i gcás an cead Carta Glas agus athchóiríonn sé an reachtaíocht faoi ceadanna oibre agus ceadanna céile

source: • Employees (Provision of Information and Consulation) Act 2006: This legislation sets establishes minimum requirements for employees' right to information and consultation about the development of their employment's structure and activities
ga: • An tAcht um Fhostaithe (Faisnéis agus Comhchomhairle a Sholáthar) 2006 - Déanann an reachtaíocht seo socrú maidir le bunú socruithe chun faisnéis a sholáthar d’fhostaithe agus dul i gcomhairle leo i ngnóthais

source: Since 23 March 2008 it applies to employers with at least 50 employees
ga: Ó 23 Márta baineann sé le fostóra atá 50 fostaithe nó níos mó acu

source: • Parental Leave (Amendment) Act 2006 amends the Parental Leave Act 1998 which provides for a period of unpaid parental leave for parents to care for their children and for a limited right to paid leave in circumstances of serious family illness (force majeure)
ga: • Leasaíonn an tAcht um Shaoire do Thuismitheoirí (Leasú) 2006 an tAcht um Shaoire Tuismitheoirí 1998 a leagann síos gur féidir le tuismitheoirí tréimhse saoire a thógáil gan phá le cúram a chur ar fáil dá leanaí chomh maith leis an gceart saoire teoranta a thógáil le pá má bhíonn mórthinneas clainne ann (Force Majeure)

source: • Safety, Health and Welfare at Work Act 2005: This legislation replaced the provisions of the Safety, Health and Welfare Act 1989 when it came into operation on 1st September 2005. It consolidates and updates the existing health and safety law
ga: • Nuair a cuireadh an tAcht um Shábháilteacht, Sláinte agus agus Leas ag Obair 2005 i bhfeidhm ar an 1 Meán Fómhair 2005, cuireadh a fhorálacha sin i bhfeidhm in áit forálacha an Achta um Shábháilteacht, Sláinte agus Leas ag an Obair, 1989

source: Changes include the provision for higher fines for breaches of safety legislation
ga: Comhdhlúthaíonn agus leasaíonn sé an dlí sláinte agus sábháilteachta reatha

source: • Adoptive Leave Act 2005: It amends the Adoptive Leave Act, 1995 which provides for adoptive leave from employment principally by the adoptive mother and for her right to return to work following such leave
ga: • Leasaíonn an tAcht um Shaoire Uchtála 2005 an tAcht um Shaoire Uchtála 1995 a soláthraíonn saoire ón bhfostaíocht don mháthair uchtála go háirid agus a ceart filleadh ar an obair tar éis na saoire sin

source: • Maternity Protection (Amendment) Act 2004: It includes new provisions relating to ante-natal classes, additional maternity leave, breastfeeding making significant improvements to the Maternity Protection Act 1994 which covers matters such as maternity leave, the right to return to work after such leave and health/safety during and immediately after the pregnancy
ga: • An tAcht um Chosaint Mháithreachais (Leasú) 2004 - Áiríonn sé forálacha nua maidir le ranganna réamhbhreithe, saoire bhreise mháithreachais, beathú cíche, agus cuireann sé feabhas mór ar an Acht um Chosaint Mháithreachais 1994 a bhaineann le saoire mháithreachais, an ceart filleadh ar an obair tar éis na saoire sin agus sláinte/sábháilteacht i rith agus i ndiaidh an toirchis

source: • Equality Act 2004: This legislation makes significant amendments to the Employment Equality Act 1998 which prohibits discrimination in a range of employment-related areas
ga: • An tAcht Comhionannais 2004. Déanann an reachtaíocht seo leasaithe suntasacha ar an Acht um Chomhionannas Fostaíochta 1998 a chuireann cosc ar leatrom i réimse ceisteanna a bhaineann leis an bhfostaíocht

source: The prohibited grounds of discrimination are gender, marital status, family status, age, race, religious belief, disability, sexual orientation and membership of the Traveller community
ga: Tá cosc ar leatrom a bhaineann le gnéas, stádas pósta, stádas clainne, aois, cine, creideamh, míchumas, claonadh gnéasach agus ballraíocht sa Lucht Taistil

source: The Act also prohibits sexual and other harassment
ga: Cuireann an tAcht cosc freisin ar chiapadh gnéasach agus ciapadh eile

source: The Equality Act also amends the Equal Status Act 2000 to extend the definition of sexual harassment and shift the burden of proof from the complianant to the respondent
ga: Déanann an tAcht Comhionannas 2004 an tAcht um Chomhchéime a leasú chun an sainmhíniú ar chiapadh gnéis a leathnú agus bogann sé dualgas an chruthúnais ón ghearánaí agus fágann faoin bhfreagróir é

source: • European Communities (Protection of Employees on Transfer of Undertakings) Regulations 2003. This legislation applies to any transfer of an undertaking, business or part of a business from one employer to another employer as a result of a legal transfer (including the assignment or forfeiture of a lease) or merger
ga: • Rialacháin um Chosaint Fhostaithe ar Aistriú Gnóthas 2003 - Baineann an reachtaíocht seo le haon aistriú gnóthais, gnó nó cuid de ghnó ó fhostóir amháin chuig fostóir eile a éiríonn as aistriú dlíthiúil (sannadh nó díobhadh léasa san áireamh) nó cumasc

source: Employees rights and entitlements are protected during this transfer
ga: Déantar cearta fostaithe agus a dteidlíochtaí a chosaint i rith an aistrithe seo

source: • Protection of Employees (Fixed Term Work) Act 2003: This legislation protects fixed-term employees by ensuring that they cannot be treated less favourably than comparable permanent workers and that employers cannot continually renew fixed term contracts
ga: • An tAcht um Chosaint Fostaithe (Obair Téarma Shocraithe) 2003. Cosnaíonn an reachtaíocht seo fostaithe ar théarmaí oibre socraithe trína chinntiú nach féidir caitheamh leo puinn níos measa ná le fostaithe buana eile atá inchurtha leo, agus nach féidir le fostóirí a bheith ag síorathnuachan conarthaí ar théarmaí oibre socraithe

source: Under the Act employees can only work on one or more fixed term contracts for a continuous period of four years
ga: Faoin Acht seo ní féidir le fostaithe oibriú go leanúnach ar feadh tréimhse níos faide ná ceithre bliana agus conradh nó conarthaí le téarma(í) socraithe acu

source: After this the employee is considered to have a contract of indefinite duration (e.g. a permanent contract)
ga: Glactar leis go bhfuil conradh de théarma éiginnte ag an bhfostaí ina dhiaidh seo (mar shampla, conradh buan)

source: • Organisation of Working Time (Records) (Prescribed Form and Exemptions) Regulations 2001. The main purpose of this EU Regulation is the requirement by employers to keep a record of the number of hours worked by employees on a daily and weekly basis, to keep records of leave granted to employees in each week as annual leave or as public holidays and details of the payments in respect of this leave
ga: • Rialacháin um Eagrú Ama Oibre (Taifid) (Foirm Ordaithe agus Díolúintí) 2001 - Tá an rialachán Eorpach seo ann go bunúsach le iachall a chur ar fhostóirí taifead a choinneáil den mhéid uaireanta a oibríonn fostaithe go laethúil agus go seachtainiúil, taifid a choinneáil ar shaoire a thugtar do fhostaithe gach seachtain mar chuid den saoire bhliantúil nó mar shaoire phoiblí agus sonraí maidir le híocaíochtaí i leith na saoire sin

source: Employers must also keep weekly records of starting and finishing times of employees
ga: Ní mór d’fhostóirí freisin taifid seachtainiúla a choinneáil ar na hamanna a thosnaíonn agus a chríochnaíonn na fostaithe a gcuid oibre

source: • Protection of Employees (Part-Time Work) Act 2001 - this replaces the Worker Protection (Regular Part-Time Employees) Act, 1991
ga: • An tAcht um Chosaint Fhostaithe (Obair Pháirtaimseartha) 2001 - tháinig an tAcht seo i bhfeidhm in áit an Achta um Chosaint Oibrí (Fostaithe Páirtaimseartha Rialta), 1991

source: It provides for the removal of discrimination against part-time workers where such exists
ga: Tá soláthar ann faoin Acht le fáil réidh le leatrom maidir le hoibrithe páirtaimseartha más ann dó

source: It aims to improve the quality of part-time work, to facilitate the development of part-time work on a voluntary basis and to contribute to the flexible organisation of working time in a manner that takes account of the needs of employers and workers
ga: Tá sé mar aidhm aige freisin caighdeán na hoibre páirtaimsire a fheabhsú, forbairt a dhéanamh ar an obair pháirtaimseartha ar bhonn deonach agus cur le eagrú solúbtha ama oibre ar bhealach a chuireann riachtanais na bhfostóirí agus na n-oibrithe san áireamh

source: It guarantees that part-time workers may not be treated less favourably than full-time workers
ga: Deimhníonn an tAcht nach féidir caitheamh le hoibrithe páirtaimseartha ar bhealach nach bhfuil ar chomhchéim leis an mbealach a chaitear le hoibrithe lánaimseartha

source: • Carer's Leave Act 2001 - this provides for an entitlement for employees to avail of temporary unpaid carer's leave to enable them to care personally for persons who require full-time care and attention
ga: • An tAcht um Shaoire Cúramóra 2001 - cuireann an tAcht seo tréimhse shealadach saoire gan phá ar fáil don chúramaí le deis a thabhairt dó/dí cúram pearsanta a chur ar fáil do dhaoine a dteastaíonn cúram agus aire lánaimseartha uathu

source: • National Minimum Wage Act 2000 - introduces an enforceable national minimum wage
ga: • An tAcht um Pá Íosta Náisiúnta 2000 - tá íosphá náisiúnta gur féidir a éileamh leagtha síos san Acht seo

source: • Organisation of Working Time Act 1997 - regulates a variety of employment conditions including maximum working hours, night work, annual and public holiday leave
ga: • An tAcht um Eagrú Ama Oibre 1997 - rialaíonn sé réimse coinníollacha fostaíochta ina measc uasteorainn uaireanta oibre, obair oíche, saoire bhliantúil agus poiblí

source: • Protection of Young Persons (Employment) Act 1996 - replaced previous legislation dating from 1977 and regulates the employment and working conditions of children and young persons
ga: • An tAcht um Chosaint Daoine Óga (Fostaíocht) 1996 - tagann sé in áit reachtaíochta a bhí ann ón mbliain 1977 agus rialaíonn sé fostaíocht agus coinníollacha oibre leanaí agus daoine óga

source: • Terms of Employment (Information) Act 1994 - updated previous legislation relating to the provision by employers to employees of information on such matters as job description, rate of pay and hours of work
ga: • An tAcht um Théarmaí Fostaíochta (Eolas) 1994 déanann sé reachtaíocht a bhí ann roimhe a thabhairt suas chun dáta agus a bhaineann le soláthar eolais ó fhostóirí dá bhfostaithe maidir le cur síos ar an bpost, ráta pá agus uaireanta oibre

source: • Unfair Dismissals Act 1993 - updates unfair dismissals law and amends previous legislation dating from 1977
ga: • An tAcht um Dhífhostú Éagórach 1993 déanann sé reachtaíocht a bhí ann roimhe a thabhairt suas chun dáta agus déanann sé leasú ar reachtaíocht a bhí ann ón mbliain 1977

source: Complaint or breach of rights
ga: Gearáin nó sárú cearta

source: Employment law provides protection for employees who feel their rights have been breached
ga: Tá cosaint ar fáil ón dlí fhostaíochta do fhostaithe a cheapann go bhfuil sárú déanta ar a gcearta

source: Complaints, disputes and grievances are heard before a Workplace Relations Commissioner adjudicator who will listen to both sides before completing an investigation of the complaint and issuing a decision
ga: Tugtar éisteacht do ghearáin, easaontas agus casaoidí ós comhair breithneoir an Choimisiúin um Chaidreamh san Áit Oibre a éisteoidh leis an dá thaobh roimh scrúdú a chur i gcrích maidir leis an ngearán agus cinneadh a dhéanamh

source: Often, disputes between employers and employees can be resolved using mediation
ga: Ní mór gearáin faoin reachtaíocht chomhionannas a thabhairt chuig an mBinse Comhionannais

source: Complaints, disputes or grievances regarding breaches of employment rights under certain legislation can be referred using the online complaint form available on workplacerelations.ie
ga: Is féidir éisteacht a fháil maidir le gearáin, easaontas nó casaoidí a bhaineann le sárú cearta fostaíochta faoi reachtaíocht faoi leith tríd an fhoirm ghearáin ar líne a úsáid á fáil ar workplacerelations.ie

source: Before you apply to have your complaint heard, you must notify your employer of your intention to contact the Workplace Relations Commission
ga: Sula ndéanann tú iarratas ar do ghearán a phlé ní mór duit a chur in iúl do d’fhostóir go bhfuil sé ar intinn agat teagmháil a dhéanamh leis Coimisiún um Chaidreamh san Áit Oibre

source: Where legal entitlements are involved, you should try and resolve the matter locally before referring a complaint
ga: Sa chás go bhfuil cearta dlíthiúla i gceist, ba cheart duit iarracht a dhéanamh an cheist a réiteach go háitiúil

source: The Workplace Relations Commission has published the Guide to Employment, Labour and Equality Law (pdf)
ga: D’fhoilsigh an Coimisiún um Chaidreamh san Áit Oibre an Treoir Dhlí Fostaíochta, Saothair agus Comhionannais (pdf)

source: Further information on employment protection legislation may be obtained from Workplace Relations Commission's Information and Customer Service - see 'Where to apply' below
ga: Is féidir tuilleadh eolais maidir leis an reachtaíocht um chosaint fhostaíochta a fháil ón tSeirbhís Fhaisnéise agus Custaiméara an Choimisiúin um Chaidreamh san Áit Oibre - féach 'Cá háit a ndéanfaidh mé iarratas' thíos

source: Further information on the Employment Equality Acts 1998–2015 and the Equal Status Acts 2000–2015 may be obtained from the Irish Human Rights and Equality Commission. Where to apply Workplace Relations Commission Information and Customer Service O'Brien Road Carlow R93 W7W2 Ireland Opening Hours: Mon. to Fri
ga: Is féidir tuilleadh eolais a fháil maidir leis an Acht um Chomhionannas Fostaíochta 1998-2015 agus leis an Acht um Chomhionannas Stádais 2000-2015 ón Choimisiún na hÉireann um Chearta an Duine agus Comhionannas
